# Homebrew Package List
# Generated on: Fri Nov 21 00:27:28 -03 2025
# Hostname: iklos-MacBook-Pro.local
# Homebrew version: Homebrew 5.0.3
#
# To install all packages, run: brew bundle install
# To update this file, run: ./scripts/brew-export.sh
#

tap "d99kris/nchat"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "mongodb/brew"
tap "stripe/stripe-cli"
brew "act"
brew "actionlint"
brew "xz"
brew "jpeg-xl"
brew "aom"
brew "gettext"
brew "glib"
brew "harfbuzz"
brew "icu4c@76"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "apktool"
brew "argo", link: false
brew "astro"
brew "at-spi2-core"
brew "bat"
brew "boost"
brew "bzip2"
brew "ccache"
brew "cmake"
brew "cocoapods"
brew "cpulimit"
brew "crane"
brew "ctags"
brew "ctop"
brew "curl"
brew "gcc"
brew "dlib"
brew "doctl"
brew "erlang"
brew "exiftool"
brew "pango"
brew "ffmpeg"
brew "ffuf"
brew "flyway"
brew "gdk-pixbuf"
brew "geckodriver"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "glab"
brew "glow"
brew "go"
brew "go-task"
brew "gperf"
brew "librsvg"
brew "graphviz"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "helm"
brew "httpie"
brew "httrack"
brew "jadx"
brew "jq"
brew "k3d"
brew "kind"
brew "kubernetes-cli", link: false
brew "kubectx"
brew "kustomize", link: false
brew "lazydocker"
brew "lazygit"
brew "libmagic"
brew "libpcap"
brew "libpq"
brew "lua-language-server"
brew "luarocks"
brew "mailhog"
brew "make"
brew "mediamtx"
brew "minikube"
brew "mise"
brew "node@22"
brew "mongosh"
brew "zlib"
brew "mysql"
brew "ncurses"
brew "neovim"
brew "nmap"
brew "nuclei"
brew "p7zip"
brew "pgvector"
brew "pgxnclient"
brew "poppler"
brew "postgresql@14"
brew "privoxy", restart_service: :changed
brew "pv"
brew "pyenv"
brew "python-tk@3.11"
brew "tcl-tk"
brew "python-tk@3.12"
brew "rabbitmq"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "skaffold"
brew "socat"
brew "speedtest-cli"
brew "sqlmap"
brew "ta-lib"
brew "tfsec"
brew "tmux"
brew "tor", restart_service: :changed
brew "tree"
brew "trufflehog"
brew "vim"
brew "websocat"
brew "wget"
brew "yarn"
brew "zbar"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "d99kris/nchat/nchat"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/terraform"
brew "stripe/stripe-cli/stripe"
cask "anaconda"
cask "android-platform-tools"
cask "android-sdk"
cask "anki"
cask "chromedriver"
cask "chromium"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"
cask "hashicorp-vagrant"
cask "miniconda"
cask "ngrok"
cask "temurin"
cask "vagrant"
cask "vlc"
cask "xquartz"
go "github.com/praetorian-inc/fingerprintx/cmd/fingerprintx"
go "github.com/lc/gau/v2/cmd/gau"
go "github.com/OJ/gobuster/v3"
go "github.com/sensepost/gowitness"
go "github.com/projectdiscovery/httpx/cmd/httpx"
